select НАИМЕНОВАНИЕ, Н_ВЕДОМОСТИ.ИД from 
    Н_ВЕДОМОСТИ left join Н_ТИПЫ_ВЕДОМОСТЕЙ
    on Н_ВЕДОМОСТИ.ТВ_ИД=Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД
    where Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД < 1 
        and Н_ВЕДОМОСТИ.ДАТА = '2010-06-18' 
        and Н_ВЕДОМОСТИ.ДАТА > '2010-06-18'
    ;

select Н_ЛЮДИ.ФАМИЛИЯ, Н_ВЕДОМОСТИ.ДАТА, Н_СЕССИЯ.УЧГОД from
    Н_СЕССИЯ right join 
        (Н_ЛЮДИ right join Н_ВЕДОМОСТИ on Н_ЛЮДИ.ИД=Н_ВЕДОМОСТИ.ЧЛВК_ИД)
    using (ЧЛВК_ИД)
    where Н_ЛЮДИ.ИД > 100012 and Н_ВЕДОМОСТИ.ИД < 1250981
    ;

CREATE INDEX ИНДЕКС_ВЕДОМОСТИ_ИД ON Н_ВЕДОМОСТИ USING BTREE("ИД");
CREATE INDEX ИНДЕКС_ЛЮДИ_ИД ON Н_ЛЮДИ USING BTREE("ИД");
CREATE INDEX ИНДЕКС_ВЕДОМОСТИ_ЧЛВК_ИД ON Н_ВЕДОМОСТИ USING HASH("ЧЛВК_ИД");
CREATE INDEX ИНДЕКС_СЕССИЯ_ЧЛВК_ИД ON Н_СЕССИЯ USING HASH("ЧЛВК_ИД");

